{
  "data": [
    "Introduction",
    "You need to enable JavaScript to run this app.",
    "Navigation",
    "Gallery, Online Store, Workshop, About Us, FAQ, Contact Us, Get a Quote, Flavours & Servings, Log In, Sign Up",
    "Cakes and Cupcakes",
    "We do custom cakes and cupcakes to suit your every need.",
    "Locally Sourced Ingredients",
    "We use high-quality ingredients hand-picked for the best taste.",
    "Love & Care",
    "Every cake I create is a cherished slice of someone's special moment.",
    "Gluten-Free Friendly",
    "We meet any dietary restrictions with our cakes.",
    "Contact Information",
    "Delivery available, reach us at 0422-733-882.",
    "Location",
    "Melbourne, VIC 3752",
    "Follow Us",
    "Email: contact@magnoliacake.com.au, Phone: 0422-733-882",
    "Terms and Conditions",
    "ABN 50910846907",
    "Copyright",
    "Copyright © 2024 Magnolia Cakes and Cupcakes",
    "Loading Status",
    "Loading...",
    "Our Collection",
    "Wedding & Anniversary, Birthday, Any Occasion, Cupcakes, Kids Birthday, Christening, Busts, Cakes and Cupcakes.",
    "Custom Cakes and Cupcakes",
    "About Us",
    "We specialize in creating custom-made cakes tailored to your unique vision for any special occasion. Our handcrafted cakes are designed to be the centerpiece of your celebration, reflecting your style and delighting your taste buds. With attention to detail and a wide range of flavors, our cakes bring people together and create cherished memories. Maggie, our talented cake artist, has been delighting customers in Melbourne for over four years with her visually stunning and delicious creations.",
    "Delivery Information",
    "Email: contact@magnoliacake.com.au, Phone: 0422-733-882.",
    "Melbourne, VIC 3752.",
    "Follow us on social media.",
    "Opening Hours",
    "Opening Hours: [Not specified].",
    "ABN 50910846907, Copyright © 2024 Magnolia Cakes and Cupcakes.",
    "Website Functionality",
    "Gallery, Online Store, Workshop, About Us, FAQ, Contact Us, Get a Quote, Flavours & Servings, Log In, Sign Up.",
    "Business Information",
    "Terms and conditions, ABN 50910846907, Copyright © 2024 Magnolia Cakes and Cupcakes.",
    "Opening hours information is not provided.",
    "Website Notice",
    "Online Store",
    "There are currently no products. Please check later to see if new products are added.",
    "Contact us, Get a quote, FAQ.",
    "Opening Hours: Email: contact@magnoliacake.com.au Phone: 0422-733-882.",
    "Legal",
    "Website Access",
    "Login Information",
    "You need to login or signup to access this page.",
    "Our Location: Melbourne, VIC 3752. Email: contact@magnoliacake.com.au. Phone: 0422-733-882.",
    "Opening Hours: [Not specified in the raw text].",
    "Legal Information",
    "Greetings! I'm Magnolia. I once thought that with a master's degree in Biology, my days would be filled with studying cells. But life served up a sweeter plan: baking! I use cakes as my canvas, painting with flavors and adding intricate details. Established in 2020 in Melbourne, Magnolia Cakes and Cupcakes is my heartfelt endeavor. Whether you're after a detailed design, a birthday treat, a corporate theme, or even if you have a wild cake idea in mind, I'm here to make it happen.",
    "Quality Promise",
    "Quality is a promise I stand by. I handpick only the highest quality ingredients, and if you have any dietary restrictions, just let me know – I'll ensure your needs are met. Each cake I create isn't just a dessert; it's a cherished slice of someone's special moment. This dedication to quality and detail has blessed me with many happy customers and wonderful reviews.",
    "Mon-Fri 9-6PM, Sat-Sun 9-5PM.",
    "Additional Links",
    "Gallery, Online Store, Workshop, FAQ, Get a Quote, Log In, Sign Up.",
    "ABN 50910846907. Copyright © 2024 Magnolia Cakes and Cupcakes.",
    "FAQs",
    "ALL BOOKING COST, DELIVERY, DIETARY REQUIREMENTS, STORAGE.",
    "Contact Form",
    "Contact Us * indicates field is required. Name *, Mobile, Email *, Message *, Submit.",
    "Our Location: Melbourne, VIC 3752.",
    "Magnolia Cake, cakes_magnolia.",
    "Gallery, Online Store, Workshop, About Us, FAQ, Contact Us, Get a Quote",
    "Request a Quote",
    "For a custom quote on a cake not featured on our website, kindly fill in the details below with a description of your desired cake. We will promptly provide you with a personalized quote based on your specification. We look forward to creating a unique and delightful cake for your special occasion.",
    "Quote Form Fields",
    "* indicates field is required. Name, Mobile, Email, Cake or Cupcakes? (Cake, Cupcake), Servings, Coffee or Standard serves? (Coffee, Standard), Flavour (Standard, Chocolate, Vanilla, Red Velvet, Carrot and Cinnamon, Pistachio & Rose, Marble Swirl, Coffee, Mocha, Caramel), Filling (Standard, Vanilla Bean, Chocolate Cream, Cookies, Caramel, Coconut, Coffee, Raspberry, Strawberry, Blueberry, Pineapple, Mixed Berries, Mango, Passionfruit, Mint, Pistachio), Date of Event, Extra Message.",
    "File Upload",
    "Drag some files here, or click to select files.",
    "Shop Information",
    "Store, Workshop classes, Flavours & Servings, Contact Us, Get a quote, FAQ.",
    "Follow us: Magnolia Cake, cakes_magnolia. Opening Hours: Mon-Fri 9-6PM, Sat-Sun 9-5PM. Email: contact@magnoliacake.com.au, Phone: 0422-733-882.",
    "At Magnolia Cakes, we transform cake-making into an art, creating desserts that are both stunning and delicious. Our custom cakes, perfect for any occasion, are tailored to your vision, ensuring a delightful experience for every guest.",
    "Cake Sizes and Servings",
    "With a range of sizes and styles, we craft each cake with care and love to make your special moments even sweeter, so you can focus on creating cherished memories.",
    "Round Cake Serving Guide",
    "Our round cakes offer elegance and flexibility, whether you're serving a small or large gathering. Refer to the chart below to determine the best size for your event.",
    "Round Cake Sizes",
    "Size Standard Serves Coffee Serves 6\" 12 18 8\" 20 25 10\" 30 40 12\" 40 55 14\" 65 75 16\" 75 100",
    "Serving Size Note",
    "\"These serving sizes are based on standard portions and are meant to serve as a general guideline. Keep in mind that cake height, slicing methods, and individual preferences may influence the final number of servings. We recommend discussing your specific needs with our team to ensure you have the perfect cake for your celebration.\"",
    "Square Cake Serving Guide",
    "For those seeking a contemporary twist, our square cakes offer a sleek and modern design that stands out. Perfect for any celebration, they are as versatile as they are stylish.",
    "Square Cake Sizes",
    "Size Standard Serves Coffee Serves 6\" 12 18 8\" 25 30 10\" 35 50 12\" 45 70 14\" 65 100 16\" 85 130",
    "Serving Size Note for Square Cakes",
    "\"Serving sizes are based on standard portions measuring 1.5 inches x 2 inches, along with smaller coffee portions of approximately 1 inch x 2 inches. Always plan for a little extra cake to ensure everyone gets a taste!\"",
    "Delivery available. Reach us at 0422-733-882. Email: contact@magnoliacake.com.au. Our Location: Melbourne, VIC 3752.",
    "Follow us for updates and more information.",
    "Sign Up",
    "First Name, Last Name, Email, Password, I agree to the Terms and Conditions, Create Account.",
    "Login",
    "Already have an account? Log in.",
    "Gallery Categories",
    "ALL WEDDING & ANNIVERSARY, KIDS BIRTHDAY, BIRTHDAY, CHRISTENING, ANY OCCASION, BUSTS, CUPCAKES.",
    "Opening hours information not provided.",
    "Terms & Conditions",
    "By accepting this cake agreement and paying a deposit, you agree to be subject to these Terms and Conditions. Please read the following Terms and Conditions carefully before placing your order with MAGNOLIA CAKES. By using the MAGNOLIA CAKES service, you agree to be bound by these Terms and Conditions. We reserve the right to refuse the sale of goods or services or to cancel an order under certain circumstances.",
    "Photographs",
    "Please be aware that all photographs taken of your cakes prior to delivery remain property of MAGNOLIA CAKES.",
    "Copyright © 2024 Magnolia Cakes and Cupcakes. ABN 50910846907.",
    "Log In Email, Password, Forgot your password? Login. Don't have an account? Sign up for free.",
    "Contact us, Get a quote, FAQ, Our Location: Melbourne, VIC 3752.",
    "Contact Details",
    "Gallery, Online Store, Workshop, About Us, FAQ, Contact Us, Get a Quote, Flavours & Servings, Log In, Sign Up, Reset Your Password."
  ]
}